# ActualRiserHeightChanged Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ActualRiserHeightChanged Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The actual riser height for one or more stairs violates the maximum set in the type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ActualRiserHeightChanged { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ActualRiserHeightChanged As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ActualRiserHeightChanged {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace